Repository: europarcel/woocommerce-europarcel
Catalog: languages/europarcel-*.po
Languages: es_es, fr_fr, hu_hu, it_it

source: Europarcel Shipping
es_es: Envío EuroParcel
fr_fr: Livraison EuroParcel
hu_hu: EuroParcel Szállítás
it_it: Spedizione EuroParcel

source: Premium courier shipping integration with support for home delivery and locker services
es_es: Integración premium de mensajería con soporte para entrega a domicilio y servicios de taquillas
fr_fr: Intégration premium de service de coursier avec support pour la livraison à domicile et les services de casiers
hu_hu: Prémium futárszolgálat integráció házhozszállítási és csomagautomata szolgáltatásokkal
it_it: Integrazione premium per corriere con supporto per consegna a domicilio e servizi locker

source: Basic Settings
es_es: Configuración básica
fr_fr: Paramètres de base
hu_hu: Alapbeállítások
it_it: Impostazioni base

source: Configure your connection and basic plugin settings
es_es: Configura tu conexión y configuración básica del plugin
fr_fr: Configurez votre connexion et les paramètres de base du plugin
hu_hu: Kapcsolat és alap plugin beállítások konfigurálása
it_it: Configura la tua connessione e le impostazioni base del plugin

source: Method Title
es_es: Título del método
fr_fr: Titre de la méthode
hu_hu: Módszer címe
it_it: Titolo metodo

source: The shipping method title displayed in the admin shipping zones configuration
es_es: El título del método de envío mostrado en la configuración de zonas de envío del admin
fr_fr: Le titre de la méthode de livraison affiché dans la configuration des zones de livraison admin
hu_hu: A szállítási módszer címe, amely az admin szállítási zónák konfigurációjában jelenik meg
it_it: Il titolo del metodo di spedizione mostrato nella configurazione delle zone di spedizione admin

source: API Key
es_es: Clave API
fr_fr: Clé API
hu_hu: API kulcs
it_it: Chiave API

source: Your API key for accessing the shipping services.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">Get Your API Key Here →</a>
es_es: Tu clave API para acceder a los servicios de envío.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">Obtén tu clave API aquí →</a>
fr_fr: Votre clé API pour accéder aux services de livraison.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">Obtenez votre clé API ici →</a>
hu_hu: Az API kulcsod a szállítási szolgáltatások eléréséhez.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">API kulcs beszerzése itt →</a>
it_it: La tua chiave API per accedere ai servizi di spedizione.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">Ottieni la chiave API qui →</a>

source: Connection Error
es_es: Error de conexión
fr_fr: Erreur de connexion
hu_hu: Kapcsolódási hiba
it_it: Errore di connessione

source: ✅ Connected: %s
es_es: ✅ Conectado: %s
hu_hu: ✅ Csatlakoztatva: %s
it_it: ✅ Connesso: %s

source: <div class="notice notice-error inline"><p><strong>Unable to connect to eAWB.</strong> Please verify your API key is correct and try again.</p></div>
es_es: <div class="notice notice-error inline"><p><strong>No se puede conectar a eAWB.</strong> Verifica que tu clave API sea correcta e inténtalo de nuevo.</p></div>
fr_fr: <div class="notice notice-error inline"><p><strong>Impossible de se connecter à eAWB.</strong> Veuillez vérifier que votre clé API est correcte et réessayer.</p></div>
hu_hu: <div class="notice notice-error inline"><p><strong>Nem sikerült csatlakozni az eAWB-hez.</strong> Kérjük ellenőrizd, hogy az API kulcs helyes és próbáld újra.</p></div>
it_it: <div class="notice notice-error inline"><p><strong>Impossibile connettersi a eAWB.</strong> Verifica che la tua chiave API sia corretta e riprova.</p></div>

source: Service Configuration
es_es: Configuración de servicios
fr_fr: Configuration des services
hu_hu: Szolgáltatás konfiguráció
it_it: Configurazione servizi

source: Configure your shipping addresses and available services
es_es: Configura tus direcciones de envío y servicios disponibles
fr_fr: Configurez vos adresses de livraison et services disponibles
hu_hu: Szállítási címek és elérhető szolgáltatások konfigurálása
it_it: Configura i tuoi indirizzi di spedizione e servizi disponibili

source: Primary Sender Address
es_es: Dirección del remitente principal
fr_fr: Adresse d'expéditeur principale
hu_hu: Elsődleges feladói cím
it_it: Indirizzo mittente principale

source: Default sender address for eAWB order imports<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Manage Sender Addresses →</a>
es_es: Dirección del remitente predeterminada para importaciones de pedidos eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gestionar direcciones del remitente →</a>
fr_fr: Adresse d'expéditeur par défaut pour les imports de commandes eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gérer les adresses d'expéditeur →</a>
hu_hu: Alapértelmezett feladói cím az eAWB rendelés importhoz<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Feladói címek kezelése →</a>
it_it: Indirizzo mittente predefinito per importazioni ordini eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gestisci indirizzi mittente →</a>

source: Primary Billing Address
es_es: Dirección de facturación principal
fr_fr: Adresse de facturation principale
hu_hu: Elsődleges számlázási cím
it_it: Indirizzo fatturazione principale

source: Default billing address for eAWB order imports<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Manage Billing Addresses →</a>
es_es: Dirección de facturación predeterminada para importaciones de pedidos eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gestionar direcciones de facturación →</a>
fr_fr: Adresse de facturation par défaut pour les imports de commandes eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gérer les adresses de facturation →</a>
hu_hu: Alapértelmezett számlázási cím az eAWB rendelés importhoz<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Számlázási címek kezelése →</a>
it_it: Indirizzo fatturazione predefinito per importazioni ordini eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gestisci indirizzi fatturazione →</a>

source: Available Shipping Services
es_es: Servicios de envío disponibles
fr_fr: Services de livraison disponibles
hu_hu: Elérhető szállítási szolgáltatások
it_it: Servizi di spedizione disponibili

source: Select the shipping services that will be available to your customers during checkout
es_es: Selecciona los servicios de envío que estarán disponibles para tus clientes durante el checkout
fr_fr: Sélectionnez les services de livraison qui seront disponibles pour vos clients lors du checkout
hu_hu: Válaszd ki a szállítási szolgáltatásokat, amelyek elérhetőek lesznek a vásárlók számára a pénztárnál
it_it: Seleziona i servizi di spedizione che saranno disponibili per i tuoi clienti durante il checkout

source: Excluded Shipping Classes for Lockers
es_es: Clases de envío excluidas para taquillas
fr_fr: Classes d'expédition exclues pour les casiers
hu_hu: Csomagautomatából kizárt szállítási osztályok
it_it: Classi di spedizione escluse per locker

source: Select shipping classes that should not have locker delivery options available (e.g., large products or items unsuitable for lockers)
es_es: Selecciona las clases de envío que no deben tener opciones de entrega en taquilla disponibles (ej. productos grandes o artículos inadecuados para taquillas)
fr_fr: Sélectionnez les classes d'expédition qui ne doivent pas avoir d'options de livraison en casier (ex: gros produits ou articles inadaptés aux casiers)
hu_hu: Válaszd ki azokat a szállítási osztályokat, amelyekhez nem legyen elérhető csomagautomata szállítás (pl. nagy termékek vagy automatába nem megfelelő tárgyak)
it_it: Seleziona le classi di spedizione che non dovrebbero avere opzioni di consegna locker disponibili (es. prodotti grandi o articoli inadatti per locker)

source: Home Delivery Settings
es_es: Configuración de entrega a domicilio
fr_fr: Paramètres de livraison à domicile
hu_hu: Házhozszállítás beállításai
it_it: Impostazioni consegna a domicilio

source: Configure address delivery options and pricing
es_es: Configura opciones y precios de entrega a la dirección
fr_fr: Configurez les options et prix de livraison à l'adresse
hu_hu: Címre szállítás beállításai és árazása
it_it: Configura opzioni e prezzi consegna all'indirizzo

source: Home Delivery Display Name
es_es: Nombre mostrado entrega a domicilio
fr_fr: Nom d'affichage livraison à domicile
hu_hu: Házhozszállítás megjelenített neve
it_it: Nome visualizzato consegna a domicilio

source: The shipping method name shown to customers at checkout for home delivery
es_es: El nombre del método de envío mostrado a los clientes en el checkout para entrega a domicilio
fr_fr: Le nom de la méthode de livraison montré aux clients au checkout pour la livraison à domicile
hu_hu: A szállítási módszer neve, ami a vásárlók számára megjelenik a pénztárnál házhozszállításnál
it_it: Il nome del metodo di spedizione mostrato ai clienti al checkout per la consegna a domicilio

source: Home Delivery Fixed Price
es_es: Precio fijo entrega a domicilio
fr_fr: Prix fixe livraison à domicile
hu_hu: Házhozszállítás fix ár
it_it: Prezzo fisso consegna a domicilio

source: Set the fixed shipping cost for address deliveries
es_es: Establece el costo de envío fijo para entregas a la dirección
fr_fr: Définissez le coût de livraison fixe pour les livraisons à l'adresse
hu_hu: Állítsd be a fix szállítási költséget a címre szállításhoz
it_it: Imposta il costo di spedizione fisso per consegne all'indirizzo

source: Free Home Delivery Minimum Order Amount
es_es: Importe mínimo pedido entrega gratuita a domicilio
fr_fr: Montant minimum commande livraison gratuite à domicile
hu_hu: Ingyenes házhozszállítás minimum rendelési összege
it_it: Importo minimo ordine consegna gratuita a domicilio

source: Minimum order amount required to qualify for free home delivery (leave empty for no free shipping)
es_es: Importe mínimo de pedido requerido para calificar para entrega gratuita a domicilio (dejar vacío para sin envío gratuito)
fr_fr: Montant minimum de commande requis pour la livraison gratuite à domicile (laisser vide pour désactiver la livraison gratuite)
hu_hu: A minimum rendelési összeg az ingyenes házhozszállításhoz (hagyd üresen az ingyenes szállítás kikapcsolásához)
it_it: Importo minimo ordine richiesto per qualificarsi per la consegna gratuita a domicilio (lascia vuoto per nessuna spedizione gratuita)

source: Free Home Delivery Shipping Classes
es_es: Clases de envío entrega gratuita a domicilio
fr_fr: Classes d'expédition livraison gratuite à domicile
hu_hu: Ingyenes házhozszállítási szállítási osztályok
it_it: Classi di spedizione consegna gratuita a domicilio

source: Select shipping classes that will always have free home delivery regardless of order amount
es_es: Selecciona las clases de envío que siempre tendrán entrega gratuita a domicilio independientemente del importe del pedido
fr_fr: Sélectionnez les classes d'expédition qui auront toujours la livraison gratuite à domicile quel que soit le montant de la commande
hu_hu: Válaszd ki azokat a szállítási osztályokat, amelyek mindig ingyenes házhozszállítást kapnak a rendelési összegtől függetlenül
it_it: Seleziona le classi di spedizione che avranno sempre consegna gratuita a domicilio indipendentemente dall'importo dell'ordine

source: Locker Delivery Settings
es_es: Configuración de entrega en taquilla
fr_fr: Paramètres de livraison en casier
hu_hu: Csomagautomata szállítás beállításai
it_it: Impostazioni consegna locker

source: Configure locker delivery options and pricing
es_es: Configura opciones y precios de entrega en taquilla
fr_fr: Configurez les options et prix de livraison en casier
hu_hu: Csomagautomata szállítás beállításai és árazása
it_it: Configura opzioni e prezzi consegna locker

source: Locker Delivery Display Name
es_es: Nombre mostrado entrega en taquilla
fr_fr: Nom d'affichage livraison en casier
hu_hu: Csomagautomata szállítás megjelenített neve
it_it: Nome visualizzato consegna locker

source: The shipping method name shown to customers at checkout for locker delivery
es_es: El nombre del método de envío mostrado a los clientes en el checkout para entrega en taquilla
fr_fr: Le nom de la méthode de livraison montré aux clients au checkout pour la livraison en casier
hu_hu: A szállítási módszer neve, ami a vásárlók számára megjelenik a pénztárnál csomagautomata szállításnál
it_it: Il nome del metodo di spedizione mostrato ai clienti al checkout per la consegna locker

source: Locker Delivery Fixed Price
es_es: Precio fijo entrega en taquilla
fr_fr: Prix fixe livraison en casier
hu_hu: Csomagautomata szállítás fix ár
it_it: Prezzo fisso consegna locker

source: Set the fixed shipping cost for locker deliveries
es_es: Establece el costo de envío fijo para entregas en taquilla
fr_fr: Définissez le coût de livraison fixe pour les livraisons en casier
hu_hu: Állítsd be a fix szállítási költséget a csomagautomata szállításhoz
it_it: Imposta il costo di spedizione fisso per consegne locker

source: Free Locker Delivery Minimum Order Amount
es_es: Importe mínimo pedido entrega gratuita en taquilla
fr_fr: Montant minimum commande livraison gratuite en casier
hu_hu: Ingyenes csomagautomata szállítás minimum rendelési összege
it_it: Importo minimo ordine consegna gratuita locker

source: Minimum order amount required to qualify for free locker delivery (leave empty for no free shipping)
es_es: Importe mínimo de pedido requerido para calificar para entrega gratuita en taquilla (dejar vacío para sin envío gratuito)
fr_fr: Montant minimum de commande requis pour la livraison gratuite en casier (laisser vide pour désactiver la livraison gratuite)
hu_hu: A minimum rendelési összeg az ingyenes csomagautomata szállításhoz (hagyd üresen az ingyenes szállítás kikapcsolásához)
it_it: Importo minimo ordine richiesto per qualificarsi per la consegna gratuita locker (lascia vuoto per nessuna spedizione gratuita)

source: Free Locker Delivery Shipping Classes
es_es: Clases de envío entrega gratuita en taquilla
fr_fr: Classes d'expédition livraison gratuite en casier
hu_hu: Ingyenes csomagautomata szállítási osztályok
it_it: Classi di spedizione consegna gratuita locker

source: Select shipping classes that will always have free locker delivery regardless of order amount
es_es: Selecciona las clases de envío que siempre tendrán entrega gratuita en taquilla independientemente del importe del pedido
fr_fr: Sélectionnez les classes d'expédition qui auront toujours la livraison gratuite en casier quel que soit le montant de la commande
hu_hu: Válaszd ki azokat a szállítási osztályokat, amelyek mindig ingyenes csomagautomata szállítást kapnak a rendelési összegtől függetlenül
it_it: Seleziona le classi di spedizione che avranno sempre consegna gratuita locker indipendentemente dall'importo dell'ordine

source: Select Locker
es_es: Seleccionar taquilla
fr_fr: Sélectionner un casier
hu_hu: Csomagautomata kiválasztása
it_it: Seleziona locker

source: Modify Locker
es_es: Modificar taquilla
fr_fr: Modifier le casier
hu_hu: Csomagautomata módosítása
it_it: Modifica locker

source: Loading...
es_es: Cargando...
fr_fr: Chargement...
hu_hu: Betöltés...
it_it: Caricamento...

source: No couriers configured for locker delivery.
es_es: No hay mensajeros configurados para entrega en taquilla.
fr_fr: Aucun coursier configuré pour la livraison en casier.
hu_hu: Nincsenek futárszolgálatok beállítva csomagautomata szállításhoz.
it_it: Nessun corriere configurato per la consegna locker.

source: ✓ Locker selected -
es_es: ✓ Taquilla seleccionada -
fr_fr: ✓ Casier sélectionné -
hu_hu: ✓ Csomagautomata kiválasztva -
it_it: ✓ Locker selezionato -

source: Delivery locker selection
es_es: Selección de taquilla de entrega
fr_fr: Sélection du casier de livraison
hu_hu: Szállítási csomagautomata kiválasztása
it_it: Selezione locker di consegna

source: Security check failed. Please refresh the page and try again.
es_es: Verificación de seguridad falló. Por favor actualiza la página e inténtalo de nuevo.
fr_fr: Vérification de sécurité échouée. Veuillez rafraîchir la page et réessayer.
hu_hu: Biztonsági ellenőrzés sikertelen. Kérjük frissítsd az oldalt és próbáld újra.
it_it: Controllo di sicurezza fallito. Aggiorna la pagina e riprova.

source: Fixed price
es_es: Precio fijo
fr_fr: Prix fixe
hu_hu: Fix ár
it_it: Prezzo fisso

source: Calculation parameters
es_es: Parámetros de cálculo
fr_fr: Paramètres de calcul
hu_hu: Számítási paraméterek
it_it: Parametri di calcolo

source: Weight (kg)
es_es: Peso (kg)
fr_fr: Poids (kg)
hu_hu: Súly (kg)
it_it: Peso (kg)

source: Length (cm)
es_es: Longitud (cm)
fr_fr: Longueur (cm)
hu_hu: Hossz (cm)
it_it: Lunghezza (cm)

source: Width (cm)
es_es: Ancho (cm)
fr_fr: Largeur (cm)
hu_hu: Szélesség (cm)
it_it: Larghezza (cm)

source: Height (cm)
es_es: Altura (cm)
fr_fr: Hauteur (cm)
hu_hu: Magasság (cm)
it_it: Altezza (cm)

source: Price multiplier
es_es: Multiplicador de precio
fr_fr: Multiplicateur de prix
hu_hu: Ár szorzó
it_it: Moltiplicatore prezzo

source: Shipping Price Type
es_es: Tipo de precio de envío
fr_fr: Type de prix de livraison
hu_hu: Szállítási ár típusa
it_it: Tipo prezzo spedizione

source: Fixed Price
es_es: Precio fijo
fr_fr: Prix fixe
hu_hu: Fix ár
it_it: Prezzo fisso

source: Calculated Price
es_es: Precio calculado
fr_fr: Prix calculé
hu_hu: Számított ár
it_it: Prezzo calcolato

source: Cargus - Delivery to address
es_es: Cargus - Entrega a domicilio

source: DPD - Delivery to address
es_es: DPD - Entrega a domicilio

source: Fan Courier - Delivery to address
es_es: Fan Courier - Entrega a domicilio

source: GLS - Delivery to address
es_es: GLS - Entrega a domicilio

source: SameDay - Delivery to address
es_es: SameDay - Entrega a domicilio

source: Bookurier - Delivery to address
es_es: Bookurier - Entrega a domicilio

source: Sameday EasyBox - Delivery to locker
es_es: Sameday EasyBox - Entrega al casillero

source: Fan Courier FANbox - Delivery to locker
es_es: Fan Courier FANbox - Entrega al casillero

source: DPD Box - Delivery to locker
es_es: DPD Box - Entrega al casillero

source: HTTP request failed:
es_es: Solicitud HTTP falló:
fr_fr: Requête HTTP échouée:
hu_hu: HTTP kérés sikertelen:
it_it: Richiesta HTTP fallita:

source: Invalid response format
es_es: Formato de respuesta inválido
fr_fr: Format de réponse invalide
hu_hu: Érvénytelen válasz formátum
it_it: Formato risposta non valido

source: API Error
es_es: Error de API
fr_fr: Erreur API
hu_hu: API hiba
it_it: Errore API

source: API Error: HTTP
es_es: Error de API: HTTP
fr_fr: Erreur API: HTTP
hu_hu: API hiba: HTTP
it_it: Errore API: HTTP

source: Invalid JSON response:
es_es: Respuesta JSON inválida:
fr_fr: Réponse JSON invalide:
hu_hu: Érvénytelen JSON válasz:
it_it: Risposta JSON non valida:
