Repository: europarcel/woocommerce-europarcel
Catalog: languages/europarcel-com-*.po
Languages: de_de, ro_ro

source: Europarcel Shipping
de_de: EuroParcel Versand
ro_ro: Transport EuroParcel

source: Premium courier shipping integration with support for home delivery and locker services
de_de: Premium Kurierdienst-Integration mit Unterstützung für Hauslieferung und Paketstation-Services
ro_ro: Integrare premium pentru servicii de curierat cu suport pentru livrare la adresă și în locker

source: Basic Settings
de_de: Grundeinstellungen
ro_ro: Setări de bază

source: Configure your connection and basic plugin settings
de_de: Konfigurieren Sie Ihre Verbindung und grundlegende Plugin-Einstellungen
ro_ro: Configurează conexiunea și setările de bază ale plugin-ului

source: Method Title
de_de: Methodentitel
ro_ro: Titlul metodei

source: The shipping method title displayed in the admin shipping zones configuration
de_de: Der Versandmethodentitel, der in der Admin-Konfiguration der Versandzonen angezeigt wird
ro_ro: Titlul metodei de transport afișat în configurarea zonelor de transport din admin

source: API Key
de_de: API-Schlüssel
ro_ro: Cheie API

source: Your API key for accessing the shipping services.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">Get Your API Key Here →</a>
de_de: Ihr API-Schlüssel für den Zugriff auf die Versandservices.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">API-Schlüssel hier erhalten →</a>
ro_ro: Cheia ta API pentru accesarea serviciilor de transport.<br><a href="https://www.eawb.ro/dashboard/integrations" target="_blank" class="button button-secondary" style="margin-top: 5px;">Obține cheia API aici →</a>

source: Connection Error
de_de: Verbindungsfehler
ro_ro: Eroare de conexiune

source: ✅ Connected: %s
de_de: ✅ Verbunden: %s
ro_ro: ✅ Conectat: %s

source: <div class="notice notice-error inline"><p><strong>Unable to connect to eAWB.</strong> Please verify your API key is correct and try again.</p></div>
de_de: <div class="notice notice-error inline"><p><strong>Verbindung zu eAWB nicht möglich.</strong> Bitte überprüfen Sie Ihren API-Schlüssel und versuchen Sie es erneut.</p></div>
ro_ro: <div class="notice notice-error inline"><p><strong>Nu se poate conecta la eAWB.</strong> Te rugăm să verifici că cheia API este corectă și încearcă din nou.</p></div>

source: Service Configuration
de_de: Service-Konfiguration
ro_ro: Configurarea serviciilor

source: Configure your shipping addresses and available services
de_de: Konfigurieren Sie Ihre Versandadressen und verfügbaren Services
ro_ro: Configurează adresele de expediere și serviciile disponibile

source: Primary Sender Address
de_de: Primäre Absenderadresse
ro_ro: Adresa principală de expediere

source: Default sender address for eAWB order imports<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Manage Sender Addresses →</a>
de_de: Standard-Absenderadresse für eAWB-Bestellimporte<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Absenderadressen verwalten →</a>
ro_ro: Adresa implicită de expediere pentru importul comenzilor în eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=sender" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gestionează adresele de expediere →</a>

source: Primary Billing Address
de_de: Primäre Rechnungsadresse
ro_ro: Adresa principală de facturare

source: Default billing address for eAWB order imports<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Manage Billing Addresses →</a>
de_de: Standard-Rechnungsadresse für eAWB-Bestellimporte<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Rechnungsadressen verwalten →</a>
ro_ro: Adresa implicită de facturare pentru importul comenzilor în eAWB<br><a href="https://www.eawb.ro/dashboard/addresses?tab=billing" target="_blank" class="button button-secondary" style="margin-top: 5px;">Gestionează adresele de facturare →</a>

source: Available Shipping Services
de_de: Verfügbare Versandservices
ro_ro: Servicii de transport disponibile

source: Select the shipping services that will be available to your customers during checkout
de_de: Wählen Sie die Versandservices aus, die Ihren Kunden beim Checkout zur Verfügung stehen
ro_ro: Selectează serviciile de transport care vor fi disponibile clienților la finalizarea comenzii

source: Excluded Shipping Classes for Lockers
de_de: Ausgeschlossene Versandklassen für Paketstationen
ro_ro: Clase de expediere excluse pentru lockere

source: Select shipping classes that should not have locker delivery options available (e.g., large products or items unsuitable for lockers)
de_de: Wählen Sie Versandklassen aus, für die keine Paketstation-Lieferoptionen verfügbar sein sollen (z.B. große Produkte oder für Paketstationen ungeeignete Artikel)
ro_ro: Selectează clasele de expediere care nu ar trebui să aibă opțiuni de livrare în locker (ex: produse mari sau neadecvate pentru lockere)

source: Home Delivery Settings
de_de: Hauslieferung Einstellungen
ro_ro: Setări livrare la adresă

source: Configure address delivery options and pricing
de_de: Konfigurieren Sie Adresslieferung Optionen und Preise
ro_ro: Configurează opțiunile și prețurile pentru livrarea la adresă

source: Home Delivery Display Name
de_de: Hauslieferung Anzeigename
ro_ro: Numele afișat pentru livrarea la adresă

source: The shipping method name shown to customers at checkout for home delivery
de_de: Der Versandmethodenname, der Kunden beim Checkout für Hauslieferung angezeigt wird
ro_ro: Numele metodei de transport afișat clienților la checkout pentru livrarea la adresă

source: Home Delivery Fixed Price
de_de: Hauslieferung Festpreis
ro_ro: Preț fix livrare la adresă

source: Set the fixed shipping cost for address deliveries
de_de: Legen Sie die festen Versandkosten für Adresslieferungen fest
ro_ro: Setează costul fix de transport pentru livrările la adresă

source: Free Home Delivery Minimum Order Amount
de_de: Kostenlose Hauslieferung Mindestbestellwert
ro_ro: Suma minimă pentru livrare gratuită la adresă

source: Minimum order amount required to qualify for free home delivery (leave empty for no free shipping)
de_de: Mindestbestellwert für kostenlose Hauslieferung (leer lassen um kostenlosen Versand zu deaktivieren)
ro_ro: Suma minimă de comandă pentru livrare gratuită la adresă (lasă gol pentru a dezactiva livrarea gratuită)

source: Free Home Delivery Shipping Classes
de_de: Kostenlose Hauslieferung Versandklassen
ro_ro: Clase de expediere cu livrare gratuită la adresă

source: Select shipping classes that will always have free home delivery regardless of order amount
de_de: Wählen Sie Versandklassen aus, die unabhängig vom Bestellwert immer kostenlose Hauslieferung erhalten
ro_ro: Selectează clasele de expediere care vor avea întotdeauna livrare gratuită la adresă, indiferent de suma comenzii

source: Locker Delivery Settings
de_de: Paketstation Lieferung Einstellungen
ro_ro: Setări livrare în locker

source: Configure locker delivery options and pricing
de_de: Konfigurieren Sie Paketstation-Lieferoptionen und Preise
ro_ro: Configurează opțiunile și prețurile pentru livrarea în locker

source: Locker Delivery Display Name
de_de: Paketstation Lieferung Anzeigename
ro_ro: Numele afișat pentru livrarea în locker

source: The shipping method name shown to customers at checkout for locker delivery
de_de: Der Versandmethodenname, der Kunden beim Checkout für Paketstation-Lieferung angezeigt wird
ro_ro: Numele metodei de transport afișat clienților la checkout pentru livrarea în locker

source: Locker Delivery Fixed Price
de_de: Paketstation Lieferung Festpreis
ro_ro: Preț fix livrare în locker

source: Set the fixed shipping cost for locker deliveries
de_de: Legen Sie die festen Versandkosten für Paketstation-Lieferungen fest
ro_ro: Setează costul fix de transport pentru livrările în locker

source: Free Locker Delivery Minimum Order Amount
de_de: Kostenlose Paketstation Lieferung Mindestbestellwert
ro_ro: Suma minimă pentru livrare gratuită în locker

source: Minimum order amount required to qualify for free locker delivery (leave empty for no free shipping)
de_de: Mindestbestellwert für kostenlose Paketstation-Lieferung (leer lassen um kostenlosen Versand zu deaktivieren)
ro_ro: Suma minimă de comandă pentru livrare gratuită în locker (lasă gol pentru a dezactiva livrarea gratuită)

source: Free Locker Delivery Shipping Classes
de_de: Kostenlose Paketstation Lieferung Versandklassen
ro_ro: Clase de expediere cu livrare gratuită în locker

source: Select shipping classes that will always have free locker delivery regardless of order amount
de_de: Wählen Sie Versandklassen aus, die unabhängig vom Bestellwert immer kostenlose Paketstation-Lieferung erhalten
ro_ro: Selectează clasele de expediere care vor avea întotdeauna livrare gratuită în locker, indiferent de suma comenzii

source: Select Locker
de_de: Paketstation auswählen
ro_ro: Selectare locker

source: Modify Locker
de_de: Paketstation ändern
ro_ro: Modifică locker

source: Loading...
de_de: Laden...
ro_ro: Se încarcă...

source: No couriers configured for locker delivery.
de_de: Keine Kurierdienste für Paketstation-Lieferung konfiguriert.
ro_ro: Nu există curieri configurați pentru livrare în locker.

source: ✓ Locker selected -
de_de: ✓ Paketstation ausgewählt -
ro_ro: ✓ Locker selectat -

source: Delivery locker selection
de_de: Lieferpaketstation Auswahl
ro_ro: Selectarea lockerului de livrare

source: Security check failed. Please refresh the page and try again.
de_de: Sicherheitsüberprüfung fehlgeschlagen. Bitte laden Sie die Seite neu und versuchen Sie es erneut.
ro_ro: Verificarea de securitate a eșuat. Te rugăm să reîmprospătezi pagina și să încerci din nou.

source: Fixed price
de_de: Festpreis
ro_ro: Preț fix

source: Calculation parameters
de_de: Berechnungsparameter
ro_ro: Parametrii de calcul

source: Weight (kg)
de_de: Gewicht (kg)
ro_ro: Greutate (kg)

source: Length (cm)
de_de: Länge (cm)
ro_ro: Lungime (cm)

source: Width (cm)
de_de: Breite (cm)
ro_ro: Lățime (cm)

source: Height (cm)
de_de: Höhe (cm)
ro_ro: Înălțime (cm)

source: Price multiplier
de_de: Preismultiplikator
ro_ro: Multiplicator preț

source: Shipping Price Type
de_de: Versandpreistyp
ro_ro: Tipul prețului de transport

source: Fixed Price
de_de: Festpreis
ro_ro: Preț fix

source: Calculated Price
de_de: Berechneter Preis
ro_ro: Preț calculat

source: Cargus - Delivery to address
de_de: Cargus - Lieferung zur Adresse
ro_ro: Cargus - Livrare la adresă

source: DPD - Delivery to address
de_de: DPD - Lieferung zur Adresse
ro_ro: DPD - Livrare la adresă

source: Fan Courier - Delivery to address
de_de: Fan Courier - Lieferung zur Adresse
ro_ro: Fan Courier - Livrare la adresă

source: GLS - Delivery to address
de_de: GLS - Lieferung zur Adresse
ro_ro: GLS - Livrare la adresă

source: SameDay - Delivery to address
de_de: SameDay - Lieferung zur Adresse
ro_ro: SameDay - Livrare la adresă

source: Bookurier - Delivery to address
de_de: Bookurier - Lieferung zur Adresse
ro_ro: Bookurier - Livrare la adresă

source: Sameday EasyBox - Delivery to locker
de_de: Sameday EasyBox - Lieferung zum Schließfach
ro_ro: Sameday EasyBox - Livrare la locker

source: Fan Courier FANbox - Delivery to locker
de_de: Fan Courier FANbox - Lieferung zum Schließfach
ro_ro: Fan Courier FANbox - Livrare la locker

source: DPD Box - Delivery to locker
de_de: DPD Box - Lieferung zum Schließfach
ro_ro: DPD Box - Livrare la locker

source: HTTP request failed:
de_de: HTTP-Anfrage fehlgeschlagen:
ro_ro: Cererea HTTP a eșuat:

source: Invalid response format
de_de: Ungültiges Antwortformat
ro_ro: Format de răspuns nevalid

source: API Error
de_de: API-Fehler
ro_ro: Eroare API

source: API Error: HTTP
de_de: API-Fehler: HTTP
ro_ro: Eroare API: HTTP

source: Invalid JSON response:
de_de: Ungültige JSON-Antwort:
ro_ro: Răspuns JSON nevalid:
